joeycastillo/Sensor-Watch/Sensor Watch Starter Project/include/pio/saml22n18a.h
#define PIN_PA20C_SERCOM0_PAD0            20L  /**< \brief SERCOM0 signal: PAD0 on PA20 mux C */
#define MUX_PA20C_SERCOM0_PAD0             2L
#define PINMUX_PA20C_SERCOM0_PAD0  ((PIN_PA20C_SERCOM0_PAD0 << 16) | MUX_PA20C_SERCOM0_PAD0)
#define PORT_PA20C_SERCOM0_PAD0    (1ul << 20)
#define PIN_PB24C_SERCOM0_PAD0            56L  /**< \brief SERCOM0 signal: PAD0 on PB24 mux C */
#define MUX_PB24C_SERCOM0_PAD0             2L
#define PINMUX_PB24C_SERCOM0_PAD0  ((PIN_PB24C_SERCOM0_PAD0 << 16) | MUX_PB24C_SERCOM0_PAD0)
#define PORT_PB24C_SERCOM0_PAD0    (1ul << 24)
#define PIN_PA05D_SERCOM0_PAD1             5L  /**< \brief SERCOM0 signal: PAD1 on PA05 mux D */
#define MUX_PA05D_SERCOM0_PAD1             3L
#define PINMUX_PA05D_SERCOM0_PAD1  ((PIN_PA05D_SERCOM0_PAD1 << 16) | MUX_PA05D_SERCOM0_PAD1)
#define PORT_PA05D_SERCOM0_PAD1    (1ul <<  5)
#define PIN_PA09C_SERCOM0_PAD1             9L  /**< \brief SERCOM0 signal: PAD1 on PA09 mux C */
#define MUX_PA09C_SERCOM0_PAD1             2L
#define PINMUX_PA09C_SERCOM0_PAD1  ((PIN_PA09C_SERCOM0_PAD1 << 16) | MUX_PA09C_SERCOM0_PAD1)
#define PORT_PA09C_SERCOM0_PAD1    (1ul <<  9)
#define PIN_PA21C_SERCOM0_PAD1            21L  /**< \brief SERCOM0 signal: PAD1 on PA21 mux C */
#define MUX_PA21C_SERCOM0_PAD1             2L
#define PINMUX_PA21C_SERCOM0_PAD1  ((PIN_PA21C_SERCOM0_PAD1 << 16) | MUX_PA21C_SERCOM0_PAD1)
#define PORT_PA21C_SERCOM0_PAD1    (1ul << 21)
#define PIN_PB25C_SERCOM0_PAD1            57L  /**< \brief SERCOM0 signal: PAD1 on PB25 mux C */
#define MUX_PB25C_SERCOM0_PAD1             2L
#define PINMUX_PB25C_SERCOM0_PAD1  ((PIN_PB25C_SERCOM0_PAD1 << 16) | MUX_PB25C_SERCOM0_PAD1)
#define PORT_PB25C_SERCOM0_PAD1    (1ul << 25)
#define PIN_PA06D_SERCOM0_PAD2             6L  /**< \brief SERCOM0 signal: PAD2 on PA06 mux D */
#define MUX_PA06D_SERCOM0_PAD2             3L
#define PINMUX_PA06D_SERCOM0_PAD2  ((PIN_PA06D_SERCOM0_PAD2 << 16) | MUX_PA06D_SERCOM0_PAD2)
#define PORT_PA06D_SERCOM0_PAD2    (1ul <<  6)
#define PIN_PA10C_SERCOM0_PAD2            10L  /**< \brief SERCOM0 signal: PAD2 on PA10 mux C */
#define MUX_PA10C_SERCOM0_PAD2             2L
#define PINMUX_PA10C_SERCOM0_PAD2  ((PIN_PA10C_SERCOM0_PAD2 << 16) | MUX_PA10C_SERCOM0_PAD2)
#define PORT_PA10C_SERCOM0_PAD2    (1ul << 10)
#define PIN_PA22C_SERCOM0_PAD2            22L  /**< \brief SERCOM0 signal: PAD2 on PA22 mux C */
#define MUX_PA22C_SERCOM0_PAD2             2L
#define PINMUX_PA22C_SERCOM0_PAD2  ((PIN_PA22C_SERCOM0_PAD2 << 16) | MUX_PA22C_SERCOM0_PAD2)
#define PORT_PA22C_SERCOM0_PAD2    (1ul << 22)
#define PIN_PC24C_SERCOM0_PAD2            88L  /**< \brief SERCOM0 signal: PAD2 on PC24 mux C */
#define MUX_PC24C_SERCOM0_PAD2             2L
#define PINMUX_PC24C_SERCOM0_PAD2  ((PIN_PC24C_SERCOM0_PAD2 << 16) | MUX_PC24C_SERCOM0_PAD2)
#define PORT_PC24C_SERCOM0_PAD2    (1ul << 24)
#define PIN_PB22C_SERCOM0_PAD2            54L  /**< \brief SERCOM0 signal: PAD2 on PB22 mux C */
#define MUX_PB22C_SERCOM0_PAD2             2L
#define PINMUX_PB22C_SERCOM0_PAD2  ((PIN_PB22C_SERCOM0_PAD2 << 16) | MUX_PB22C_SERCOM0_PAD2)
#define PORT_PB22C_SERCOM0_PAD2    (1ul << 22)
#define PIN_PA07D_SERCOM0_PAD3             7L  /**< \brief SERCOM0 signal: PAD3 on PA07 mux D */
#define MUX_PA07D_SERCOM0_PAD3             3L
#define PINMUX_PA07D_SERCOM0_PAD3  ((PIN_PA07D_SERCOM0_PAD3 << 16) | MUX_PA07D_SERCOM0_PAD3)
#define PORT_PA07D_SERCOM0_PAD3    (1ul <<  7)
#define PIN_PA11C_SERCOM0_PAD3            11L  /**< \brief SERCOM0 signal: PAD3 on PA11 mux C */
#define MUX_PA11C_SERCOM0_PAD3             2L
#define PINMUX_PA11C_SERCOM0_PAD3  ((PIN_PA11C_SERCOM0_PAD3 << 16) | MUX_PA11C_SERCOM0_PAD3)
#define PORT_PA11C_SERCOM0_PAD3    (1ul << 11)
#define PIN_PA23C_SERCOM0_PAD3            23L  /**< \brief SERCOM0 signal: PAD3 on PA23 mux C */
#define MUX_PA23C_SERCOM0_PAD3             2L
#define PINMUX_PA23C_SERCOM0_PAD3  ((PIN_PA23C_SERCOM0_PAD3 << 16) | MUX_PA23C_SERCOM0_PAD3)
#define PORT_PA23C_SERCOM0_PAD3    (1ul << 23)
#define PIN_PC25C_SERCOM0_PAD3            89L  /**< \brief SERCOM0 signal: PAD3 on PC25 mux C */
#define MUX_PC25C_SERCOM0_PAD3             2L
#define PINMUX_PC25C_SERCOM0_PAD3  ((PIN_PC25C_SERCOM0_PAD3 << 16) | MUX_PC25C_SERCOM0_PAD3)
#define PORT_PC25C_SERCOM0_PAD3    (1ul << 25)
#define PIN_PB23C_SERCOM0_PAD3            55L  /**< \brief SERCOM0 signal: PAD3 on PB23 mux C */
#define MUX_PB23C_SERCOM0_PAD3             2L
#define PINMUX_PB23C_SERCOM0_PAD3  ((PIN_PB23C_SERCOM0_PAD3 << 16) | MUX_PB23C_SERCOM0_PAD3)
#define PORT_PB23C_SERCOM0_PAD3    (1ul << 23)
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PB30C_SERCOM1_PAD0            62L  /**< \brief SERCOM1 signal: PAD0 on PB30 mux C */
#define MUX_PB30C_SERCOM1_PAD0             2L
#define PINMUX_PB30C_SERCOM1_PAD0  ((PIN_PB30C_SERCOM1_PAD0 << 16) | MUX_PB30C_SERCOM1_PAD0)
#define PORT_PB30C_SERCOM1_PAD0    (1ul << 30)
#define PIN_PA00D_SERCOM1_PAD0             0L  /**< \brief SERCOM1 signal: PAD0 on PA00 mux D */
#define MUX_PA00D_SERCOM1_PAD0             3L
#define PINMUX_PA00D_SERCOM1_PAD0  ((PIN_PA00D_SERCOM1_PAD0 << 16) | MUX_PA00D_SERCOM1_PAD0)
#define PORT_PA00D_SERCOM1_PAD0    (1ul <<  0)
#define PIN_PC27D_SERCOM1_PAD0            91L  /**< \brief SERCOM1 signal: PAD0 on PC27 mux D */
#define MUX_PC27D_SERCOM1_PAD0             3L
#define PINMUX_PC27D_SERCOM1_PAD0  ((PIN_PC27D_SERCOM1_PAD0 << 16) | MUX_PC27D_SERCOM1_PAD0)
#define PORT_PC27D_SERCOM1_PAD0    (1ul << 27)
#define PIN_PA16C_SERCOM1_PAD0            16L  /**< \brief SERCOM1 signal: PAD0 on PA16 mux C */
#define MUX_PA16C_SERCOM1_PAD0             2L
#define PINMUX_PA16C_SERCOM1_PAD0  ((PIN_PA16C_SERCOM1_PAD0 << 16) | MUX_PA16C_SERCOM1_PAD0)
#define PORT_PA16C_SERCOM1_PAD0    (1ul << 16)
#define PIN_PC12C_SERCOM1_PAD0            76L  /**< \brief SERCOM1 signal: PAD0 on PC12 mux C */
#define MUX_PC12C_SERCOM1_PAD0             2L
#define PINMUX_PC12C_SERCOM1_PAD0  ((PIN_PC12C_SERCOM1_PAD0 << 16) | MUX_PC12C_SERCOM1_PAD0)
#define PORT_PC12C_SERCOM1_PAD0    (1ul << 12)
#define PIN_PB31C_SERCOM1_PAD1            63L  /**< \brief SERCOM1 signal: PAD1 on PB31 mux C */
#define MUX_PB31C_SERCOM1_PAD1             2L
#define PINMUX_PB31C_SERCOM1_PAD1  ((PIN_PB31C_SERCOM1_PAD1 << 16) | MUX_PB31C_SERCOM1_PAD1)
#define PORT_PB31C_SERCOM1_PAD1    (1ul << 31)
#define PIN_PA01D_SERCOM1_PAD1             1L  /**< \brief SERCOM1 signal: PAD1 on PA01 mux D */
#define MUX_PA01D_SERCOM1_PAD1             3L
#define PINMUX_PA01D_SERCOM1_PAD1  ((PIN_PA01D_SERCOM1_PAD1 << 16) | MUX_PA01D_SERCOM1_PAD1)
#define PORT_PA01D_SERCOM1_PAD1    (1ul <<  1)
#define PIN_PC28D_SERCOM1_PAD1            92L  /**< \brief SERCOM1 signal: PAD1 on PC28 mux D */
#define MUX_PC28D_SERCOM1_PAD1             3L
#define PINMUX_PC28D_SERCOM1_PAD1  ((PIN_PC28D_SERCOM1_PAD1 << 16) | MUX_PC28D_SERCOM1_PAD1)
#define PORT_PC28D_SERCOM1_PAD1    (1ul << 28)
#define PIN_PA17C_SERCOM1_PAD1            17L  /**< \brief SERCOM1 signal: PAD1 on PA17 mux C */
#define MUX_PA17C_SERCOM1_PAD1             2L
#define PINMUX_PA17C_SERCOM1_PAD1  ((PIN_PA17C_SERCOM1_PAD1 << 16) | MUX_PA17C_SERCOM1_PAD1)
#define PORT_PA17C_SERCOM1_PAD1    (1ul << 17)
#define PIN_PC13C_SERCOM1_PAD1            77L  /**< \brief SERCOM1 signal: PAD1 on PC13 mux C */
#define MUX_PC13C_SERCOM1_PAD1             2L
#define PINMUX_PC13C_SERCOM1_PAD1  ((PIN_PC13C_SERCOM1_PAD1 << 16) | MUX_PC13C_SERCOM1_PAD1)
#define PORT_PC13C_SERCOM1_PAD1    (1ul << 13)
#define PIN_PA30D_SERCOM1_PAD2            30L  /**< \brief SERCOM1 signal: PAD2 on PA30 mux D */
#define MUX_PA30D_SERCOM1_PAD2             3L
#define PINMUX_PA30D_SERCOM1_PAD2  ((PIN_PA30D_SERCOM1_PAD2 << 16) | MUX_PA30D_SERCOM1_PAD2)
#define PORT_PA30D_SERCOM1_PAD2    (1ul << 30)
#define PIN_PA18C_SERCOM1_PAD2            18L  /**< \brief SERCOM1 signal: PAD2 on PA18 mux C */
#define MUX_PA18C_SERCOM1_PAD2             2L
#define PINMUX_PA18C_SERCOM1_PAD2  ((PIN_PA18C_SERCOM1_PAD2 << 16) | MUX_PA18C_SERCOM1_PAD2)
#define PORT_PA18C_SERCOM1_PAD2    (1ul << 18)
#define PIN_PC10C_SERCOM1_PAD2            74L  /**< \brief SERCOM1 signal: PAD2 on PC10 mux C */
#define MUX_PC10C_SERCOM1_PAD2             2L
#define PINMUX_PC10C_SERCOM1_PAD2  ((PIN_PC10C_SERCOM1_PAD2 << 16) | MUX_PC10C_SERCOM1_PAD2)
#define PORT_PC10C_SERCOM1_PAD2    (1ul << 10)
#define PIN_PA31D_SERCOM1_PAD3            31L  /**< \brief SERCOM1 signal: PAD3 on PA31 mux D */
#define MUX_PA31D_SERCOM1_PAD3             3L
#define PINMUX_PA31D_SERCOM1_PAD3  ((PIN_PA31D_SERCOM1_PAD3 << 16) | MUX_PA31D_SERCOM1_PAD3)
#define PORT_PA31D_SERCOM1_PAD3    (1ul << 31)
#define PIN_PA19C_SERCOM1_PAD3            19L  /**< \brief SERCOM1 signal: PAD3 on PA19 mux C */
#define MUX_PA19C_SERCOM1_PAD3             2L
#define PINMUX_PA19C_SERCOM1_PAD3  ((PIN_PA19C_SERCOM1_PAD3 << 16) | MUX_PA19C_SERCOM1_PAD3)
#define PORT_PA19C_SERCOM1_PAD3    (1ul << 19)
#define PIN_PC11C_SERCOM1_PAD3            75L  /**< \brief SERCOM1 signal: PAD3 on PC11 mux C */
#define MUX_PC11C_SERCOM1_PAD3             2L
#define PINMUX_PC11C_SERCOM1_PAD3  ((PIN_PC11C_SERCOM1_PAD3 << 16) | MUX_PC11C_SERCOM1_PAD3)
#define PORT_PC11C_SERCOM1_PAD3    (1ul << 11)
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PA22D_SERCOM2_PAD0            22L  /**< \brief SERCOM2 signal: PAD0 on PA22 mux D */
#define MUX_PA22D_SERCOM2_PAD0             3L
#define PINMUX_PA22D_SERCOM2_PAD0  ((PIN_PA22D_SERCOM2_PAD0 << 16) | MUX_PA22D_SERCOM2_PAD0)
#define PORT_PA22D_SERCOM2_PAD0    (1ul << 22)
#define PIN_PA16D_SERCOM2_PAD0            16L  /**< \brief SERCOM2 signal: PAD0 on PA16 mux D */
#define MUX_PA16D_SERCOM2_PAD0             3L
#define PINMUX_PA16D_SERCOM2_PAD0  ((PIN_PA16D_SERCOM2_PAD0 << 16) | MUX_PA16D_SERCOM2_PAD0)
#define PORT_PA16D_SERCOM2_PAD0    (1ul << 16)
#define PIN_PA23D_SERCOM2_PAD1            23L  /**< \brief SERCOM2 signal: PAD1 on PA23 mux D */
#define MUX_PA23D_SERCOM2_PAD1             3L
#define PINMUX_PA23D_SERCOM2_PAD1  ((PIN_PA23D_SERCOM2_PAD1 << 16) | MUX_PA23D_SERCOM2_PAD1)
#define PORT_PA23D_SERCOM2_PAD1    (1ul << 23)
#define PIN_PA17D_SERCOM2_PAD1            17L  /**< \brief SERCOM2 signal: PAD1 on PA17 mux D */
#define MUX_PA17D_SERCOM2_PAD1             3L
#define PINMUX_PA17D_SERCOM2_PAD1  ((PIN_PA17D_SERCOM2_PAD1 << 16) | MUX_PA17D_SERCOM2_PAD1)
#define PORT_PA17D_SERCOM2_PAD1    (1ul << 17)
#define PIN_PA18D_SERCOM2_PAD2            18L  /**< \brief SERCOM2 signal: PAD2 on PA18 mux D */
#define MUX_PA18D_SERCOM2_PAD2             3L
#define PINMUX_PA18D_SERCOM2_PAD2  ((PIN_PA18D_SERCOM2_PAD2 << 16) | MUX_PA18D_SERCOM2_PAD2)
#define PORT_PA18D_SERCOM2_PAD2    (1ul << 18)
#define PIN_PA20D_SERCOM2_PAD2            20L  /**< \brief SERCOM2 signal: PAD2 on PA20 mux D */
#define MUX_PA20D_SERCOM2_PAD2             3L
#define PINMUX_PA20D_SERCOM2_PAD2  ((PIN_PA20D_SERCOM2_PAD2 << 16) | MUX_PA20D_SERCOM2_PAD2)
#define PORT_PA20D_SERCOM2_PAD2    (1ul << 20)
#define PIN_PA24C_SERCOM2_PAD2            24L  /**< \brief SERCOM2 signal: PAD2 on PA24 mux C */
#define MUX_PA24C_SERCOM2_PAD2             2L
#define PINMUX_PA24C_SERCOM2_PAD2  ((PIN_PA24C_SERCOM2_PAD2 << 16) | MUX_PA24C_SERCOM2_PAD2)
#define PORT_PA24C_SERCOM2_PAD2    (1ul << 24)
#define PIN_PA19D_SERCOM2_PAD3            19L  /**< \brief SERCOM2 signal: PAD3 on PA19 mux D */
#define MUX_PA19D_SERCOM2_PAD3             3L
#define PINMUX_PA19D_SERCOM2_PAD3  ((PIN_PA19D_SERCOM2_PAD3 << 16) | MUX_PA19D_SERCOM2_PAD3)
#define PORT_PA19D_SERCOM2_PAD3    (1ul << 19)
#define PIN_PA21D_SERCOM2_PAD3            21L  /**< \brief SERCOM2 signal: PAD3 on PA21 mux D */
#define MUX_PA21D_SERCOM2_PAD3             3L
#define PINMUX_PA21D_SERCOM2_PAD3  ((PIN_PA21D_SERCOM2_PAD3 << 16) | MUX_PA21D_SERCOM2_PAD3)
#define PORT_PA21D_SERCOM2_PAD3    (1ul << 21)
#define PIN_PA25C_SERCOM2_PAD3            25L  /**< \brief SERCOM2 signal: PAD3 on PA25 mux C */
#define MUX_PA25C_SERCOM2_PAD3             2L
#define PINMUX_PA25C_SERCOM2_PAD3  ((PIN_PA25C_SERCOM2_PAD3 << 16) | MUX_PA25C_SERCOM2_PAD3)
#define PORT_PA25C_SERCOM2_PAD3    (1ul << 25)
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PB12C_SERCOM3_PAD0            44L  /**< \brief SERCOM3 signal: PAD0 on PB12 mux C */
#define MUX_PB12C_SERCOM3_PAD0             2L
#define PINMUX_PB12C_SERCOM3_PAD0  ((PIN_PB12C_SERCOM3_PAD0 << 16) | MUX_PB12C_SERCOM3_PAD0)
#define PORT_PB12C_SERCOM3_PAD0    (1ul << 12)
#define PIN_PA12D_SERCOM3_PAD0            12L  /**< \brief SERCOM3 signal: PAD0 on PA12 mux D */
#define MUX_PA12D_SERCOM3_PAD0             3L
#define PINMUX_PA12D_SERCOM3_PAD0  ((PIN_PA12D_SERCOM3_PAD0 << 16) | MUX_PA12D_SERCOM3_PAD0)
#define PORT_PA12D_SERCOM3_PAD0    (1ul << 12)
#define PIN_PB08D_SERCOM3_PAD0            40L  /**< \brief SERCOM3 signal: PAD0 on PB08 mux D */
#define MUX_PB08D_SERCOM3_PAD0             3L
#define PINMUX_PB08D_SERCOM3_PAD0  ((PIN_PB08D_SERCOM3_PAD0 << 16) | MUX_PB08D_SERCOM3_PAD0)
#define PORT_PB08D_SERCOM3_PAD0    (1ul <<  8)
#define PIN_PB02C_SERCOM3_PAD0            34L  /**< \brief SERCOM3 signal: PAD0 on PB02 mux C */
#define MUX_PB02C_SERCOM3_PAD0             2L
#define PINMUX_PB02C_SERCOM3_PAD0  ((PIN_PB02C_SERCOM3_PAD0 << 16) | MUX_PB02C_SERCOM3_PAD0)
#define PORT_PB02C_SERCOM3_PAD0    (1ul <<  2)
#define PIN_PB20C_SERCOM3_PAD0            52L  /**< \brief SERCOM3 signal: PAD0 on PB20 mux C */
#define MUX_PB20C_SERCOM3_PAD0             2L
#define PINMUX_PB20C_SERCOM3_PAD0  ((PIN_PB20C_SERCOM3_PAD0 << 16) | MUX_PB20C_SERCOM3_PAD0)
#define PORT_PB20C_SERCOM3_PAD0    (1ul << 20)
#define PIN_PB13C_SERCOM3_PAD1            45L  /**< \brief SERCOM3 signal: PAD1 on PB13 mux C */
#define MUX_PB13C_SERCOM3_PAD1             2L
#define PINMUX_PB13C_SERCOM3_PAD1  ((PIN_PB13C_SERCOM3_PAD1 << 16) | MUX_PB13C_SERCOM3_PAD1)
#define PORT_PB13C_SERCOM3_PAD1    (1ul << 13)
#define PIN_PA13D_SERCOM3_PAD1            13L  /**< \brief SERCOM3 signal: PAD1 on PA13 mux D */
#define MUX_PA13D_SERCOM3_PAD1             3L
#define PINMUX_PA13D_SERCOM3_PAD1  ((PIN_PA13D_SERCOM3_PAD1 << 16) | MUX_PA13D_SERCOM3_PAD1)
#define PORT_PA13D_SERCOM3_PAD1    (1ul << 13)
#define PIN_PB09D_SERCOM3_PAD1            41L  /**< \brief SERCOM3 signal: PAD1 on PB09 mux D */
#define MUX_PB09D_SERCOM3_PAD1             3L
#define PINMUX_PB09D_SERCOM3_PAD1  ((PIN_PB09D_SERCOM3_PAD1 << 16) | MUX_PB09D_SERCOM3_PAD1)
#define PORT_PB09D_SERCOM3_PAD1    (1ul <<  9)
#define PIN_PB03C_SERCOM3_PAD1            35L  /**< \brief SERCOM3 signal: PAD1 on PB03 mux C */
#define MUX_PB03C_SERCOM3_PAD1             2L
#define PINMUX_PB03C_SERCOM3_PAD1  ((PIN_PB03C_SERCOM3_PAD1 << 16) | MUX_PB03C_SERCOM3_PAD1)
#define PORT_PB03C_SERCOM3_PAD1    (1ul <<  3)
#define PIN_PB21C_SERCOM3_PAD1            53L  /**< \brief SERCOM3 signal: PAD1 on PB21 mux C */
#define MUX_PB21C_SERCOM3_PAD1             2L
#define PINMUX_PB21C_SERCOM3_PAD1  ((PIN_PB21C_SERCOM3_PAD1 << 16) | MUX_PB21C_SERCOM3_PAD1)
#define PORT_PB21C_SERCOM3_PAD1    (1ul << 21)
#define PIN_PB14C_SERCOM3_PAD2            46L  /**< \brief SERCOM3 signal: PAD2 on PB14 mux C */
#define MUX_PB14C_SERCOM3_PAD2             2L
#define PINMUX_PB14C_SERCOM3_PAD2  ((PIN_PB14C_SERCOM3_PAD2 << 16) | MUX_PB14C_SERCOM3_PAD2)
#define PORT_PB14C_SERCOM3_PAD2    (1ul << 14)
#define PIN_PA14D_SERCOM3_PAD2            14L  /**< \brief SERCOM3 signal: PAD2 on PA14 mux D */
#define MUX_PA14D_SERCOM3_PAD2             3L
#define PINMUX_PA14D_SERCOM3_PAD2  ((PIN_PA14D_SERCOM3_PAD2 << 16) | MUX_PA14D_SERCOM3_PAD2)
#define PORT_PA14D_SERCOM3_PAD2    (1ul << 14)
#define PIN_PB18D_SERCOM3_PAD2            50L  /**< \brief SERCOM3 signal: PAD2 on PB18 mux D */
#define MUX_PB18D_SERCOM3_PAD2             3L
#define PINMUX_PB18D_SERCOM3_PAD2  ((PIN_PB18D_SERCOM3_PAD2 << 16) | MUX_PB18D_SERCOM3_PAD2)
#define PORT_PB18D_SERCOM3_PAD2    (1ul << 18)
#define PIN_PB00C_SERCOM3_PAD2            32L  /**< \brief SERCOM3 signal: PAD2 on PB00 mux C */
#define MUX_PB00C_SERCOM3_PAD2             2L
#define PINMUX_PB00C_SERCOM3_PAD2  ((PIN_PB00C_SERCOM3_PAD2 << 16) | MUX_PB00C_SERCOM3_PAD2)
#define PORT_PB00C_SERCOM3_PAD2    (1ul <<  0)
#define PIN_PB15C_SERCOM3_PAD3            47L  /**< \brief SERCOM3 signal: PAD3 on PB15 mux C */
#define MUX_PB15C_SERCOM3_PAD3             2L
#define PINMUX_PB15C_SERCOM3_PAD3  ((PIN_PB15C_SERCOM3_PAD3 << 16) | MUX_PB15C_SERCOM3_PAD3)
#define PORT_PB15C_SERCOM3_PAD3    (1ul << 15)
#define PIN_PA15D_SERCOM3_PAD3            15L  /**< \brief SERCOM3 signal: PAD3 on PA15 mux D */
#define MUX_PA15D_SERCOM3_PAD3             3L
#define PINMUX_PA15D_SERCOM3_PAD3  ((PIN_PA15D_SERCOM3_PAD3 << 16) | MUX_PA15D_SERCOM3_PAD3)
#define PORT_PA15D_SERCOM3_PAD3    (1ul << 15)
#define PIN_PB11D_SERCOM3_PAD3            43L  /**< \brief SERCOM3 signal: PAD3 on PB11 mux D */
#define MUX_PB11D_SERCOM3_PAD3             3L
#define PINMUX_PB11D_SERCOM3_PAD3  ((PIN_PB11D_SERCOM3_PAD3 << 16) | MUX_PB11D_SERCOM3_PAD3)
#define PORT_PB11D_SERCOM3_PAD3    (1ul << 11)
#define PIN_PB19D_SERCOM3_PAD3            51L  /**< \brief SERCOM3 signal: PAD3 on PB19 mux D */
#define MUX_PB19D_SERCOM3_PAD3             3L
#define PINMUX_PB19D_SERCOM3_PAD3  ((PIN_PB19D_SERCOM3_PAD3 << 16) | MUX_PB19D_SERCOM3_PAD3)
#define PORT_PB19D_SERCOM3_PAD3    (1ul << 19)
#define PIN_PB01C_SERCOM3_PAD3            33L  /**< \brief SERCOM3 signal: PAD3 on PB01 mux C */
#define MUX_PB01C_SERCOM3_PAD3             2L
#define PINMUX_PB01C_SERCOM3_PAD3  ((PIN_PB01C_SERCOM3_PAD3 << 16) | MUX_PB01C_SERCOM3_PAD3)
#define PORT_PB01C_SERCOM3_PAD3    (1ul <<  1)
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PA08D_SERCOM4_PAD0             8L  /**< \brief SERCOM4 signal: PAD0 on PA08 mux D */
#define MUX_PA08D_SERCOM4_PAD0             3L
#define PINMUX_PA08D_SERCOM4_PAD0  ((PIN_PA08D_SERCOM4_PAD0 << 16) | MUX_PA08D_SERCOM4_PAD0)
#define PORT_PA08D_SERCOM4_PAD0    (1ul <<  8)
#define PIN_PB24D_SERCOM4_PAD0            56L  /**< \brief SERCOM4 signal: PAD0 on PB24 mux D */
#define MUX_PB24D_SERCOM4_PAD0             3L
#define PINMUX_PB24D_SERCOM4_PAD0  ((PIN_PB24D_SERCOM4_PAD0 << 16) | MUX_PB24D_SERCOM4_PAD0)
#define PORT_PB24D_SERCOM4_PAD0    (1ul << 24)
#define PIN_PA12C_SERCOM4_PAD0            12L  /**< \brief SERCOM4 signal: PAD0 on PA12 mux C */
#define MUX_PA12C_SERCOM4_PAD0             2L
#define PINMUX_PA12C_SERCOM4_PAD0  ((PIN_PA12C_SERCOM4_PAD0 << 16) | MUX_PA12C_SERCOM4_PAD0)
#define PORT_PA12C_SERCOM4_PAD0    (1ul << 12)
#define PIN_PA09D_SERCOM4_PAD1             9L  /**< \brief SERCOM4 signal: PAD1 on PA09 mux D */
#define MUX_PA09D_SERCOM4_PAD1             3L
#define PINMUX_PA09D_SERCOM4_PAD1  ((PIN_PA09D_SERCOM4_PAD1 << 16) | MUX_PA09D_SERCOM4_PAD1)
#define PORT_PA09D_SERCOM4_PAD1    (1ul <<  9)
#define PIN_PB25D_SERCOM4_PAD1            57L  /**< \brief SERCOM4 signal: PAD1 on PB25 mux D */
#define MUX_PB25D_SERCOM4_PAD1             3L
#define PINMUX_PB25D_SERCOM4_PAD1  ((PIN_PB25D_SERCOM4_PAD1 << 16) | MUX_PB25D_SERCOM4_PAD1)
#define PORT_PB25D_SERCOM4_PAD1    (1ul << 25)
#define PIN_PA13C_SERCOM4_PAD1            13L  /**< \brief SERCOM4 signal: PAD1 on PA13 mux C */
#define MUX_PA13C_SERCOM4_PAD1             2L
#define PINMUX_PA13C_SERCOM4_PAD1  ((PIN_PA13C_SERCOM4_PAD1 << 16) | MUX_PA13C_SERCOM4_PAD1)
#define PORT_PA13C_SERCOM4_PAD1    (1ul << 13)
#define PIN_PA10D_SERCOM4_PAD2            10L  /**< \brief SERCOM4 signal: PAD2 on PA10 mux D */
#define MUX_PA10D_SERCOM4_PAD2             3L
#define PINMUX_PA10D_SERCOM4_PAD2  ((PIN_PA10D_SERCOM4_PAD2 << 16) | MUX_PA10D_SERCOM4_PAD2)
#define PORT_PA10D_SERCOM4_PAD2    (1ul << 10)
#define PIN_PC24D_SERCOM4_PAD2            88L  /**< \brief SERCOM4 signal: PAD2 on PC24 mux D */
#define MUX_PC24D_SERCOM4_PAD2             3L
#define PINMUX_PC24D_SERCOM4_PAD2  ((PIN_PC24D_SERCOM4_PAD2 << 16) | MUX_PC24D_SERCOM4_PAD2)
#define PORT_PC24D_SERCOM4_PAD2    (1ul << 24)
#define PIN_PA14C_SERCOM4_PAD2            14L  /**< \brief SERCOM4 signal: PAD2 on PA14 mux C */
#define MUX_PA14C_SERCOM4_PAD2             2L
#define PINMUX_PA14C_SERCOM4_PAD2  ((PIN_PA14C_SERCOM4_PAD2 << 16) | MUX_PA14C_SERCOM4_PAD2)
#define PORT_PA14C_SERCOM4_PAD2    (1ul << 14)
#define PIN_PA11D_SERCOM4_PAD3            11L  /**< \brief SERCOM4 signal: PAD3 on PA11 mux D */
#define MUX_PA11D_SERCOM4_PAD3             3L
#define PINMUX_PA11D_SERCOM4_PAD3  ((PIN_PA11D_SERCOM4_PAD3 << 16) | MUX_PA11D_SERCOM4_PAD3)
#define PORT_PA11D_SERCOM4_PAD3    (1ul << 11)
#define PIN_PC25D_SERCOM4_PAD3            89L  /**< \brief SERCOM4 signal: PAD3 on PC25 mux D */
#define MUX_PC25D_SERCOM4_PAD3             3L
#define PINMUX_PC25D_SERCOM4_PAD3  ((PIN_PC25D_SERCOM4_PAD3 << 16) | MUX_PC25D_SERCOM4_PAD3)
#define PORT_PC25D_SERCOM4_PAD3    (1ul << 25)
#define PIN_PA15C_SERCOM4_PAD3            15L  /**< \brief SERCOM4 signal: PAD3 on PA15 mux C */
#define MUX_PA15C_SERCOM4_PAD3             2L
#define PINMUX_PA15C_SERCOM4_PAD3  ((PIN_PA15C_SERCOM4_PAD3 << 16) | MUX_PA15C_SERCOM4_PAD3)
#define PORT_PA15C_SERCOM4_PAD3    (1ul << 15)
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PB30D_SERCOM5_PAD0            62L  /**< \brief SERCOM5 signal: PAD0 on PB30 mux D */
#define MUX_PB30D_SERCOM5_PAD0             3L
#define PINMUX_PB30D_SERCOM5_PAD0  ((PIN_PB30D_SERCOM5_PAD0 << 16) | MUX_PB30D_SERCOM5_PAD0)
#define PORT_PB30D_SERCOM5_PAD0    (1ul << 30)
#define PIN_PA24D_SERCOM5_PAD0            24L  /**< \brief SERCOM5 signal: PAD0 on PA24 mux D */
#define MUX_PA24D_SERCOM5_PAD0             3L
#define PINMUX_PA24D_SERCOM5_PAD0  ((PIN_PA24D_SERCOM5_PAD0 << 16) | MUX_PA24D_SERCOM5_PAD0)
#define PORT_PA24D_SERCOM5_PAD0    (1ul << 24)
#define PIN_PB02D_SERCOM5_PAD0            34L  /**< \brief SERCOM5 signal: PAD0 on PB02 mux D */
#define MUX_PB02D_SERCOM5_PAD0             3L
#define PINMUX_PB02D_SERCOM5_PAD0  ((PIN_PB02D_SERCOM5_PAD0 << 16) | MUX_PB02D_SERCOM5_PAD0)
#define PORT_PB02D_SERCOM5_PAD0    (1ul <<  2)
#define PIN_PB20D_SERCOM5_PAD0            52L  /**< \brief SERCOM5 signal: PAD0 on PB20 mux D */
#define MUX_PB20D_SERCOM5_PAD0             3L
#define PINMUX_PB20D_SERCOM5_PAD0  ((PIN_PB20D_SERCOM5_PAD0 << 16) | MUX_PB20D_SERCOM5_PAD0)
#define PORT_PB20D_SERCOM5_PAD0    (1ul << 20)
#define PIN_PB16C_SERCOM5_PAD0            48L  /**< \brief SERCOM5 signal: PAD0 on PB16 mux C */
#define MUX_PB16C_SERCOM5_PAD0             2L
#define PINMUX_PB16C_SERCOM5_PAD0  ((PIN_PB16C_SERCOM5_PAD0 << 16) | MUX_PB16C_SERCOM5_PAD0)
#define PORT_PB16C_SERCOM5_PAD0    (1ul << 16)
#define PIN_PB31D_SERCOM5_PAD1            63L  /**< \brief SERCOM5 signal: PAD1 on PB31 mux D */
#define MUX_PB31D_SERCOM5_PAD1             3L
#define PINMUX_PB31D_SERCOM5_PAD1  ((PIN_PB31D_SERCOM5_PAD1 << 16) | MUX_PB31D_SERCOM5_PAD1)
#define PORT_PB31D_SERCOM5_PAD1    (1ul << 31)
#define PIN_PA25D_SERCOM5_PAD1            25L  /**< \brief SERCOM5 signal: PAD1 on PA25 mux D */
#define MUX_PA25D_SERCOM5_PAD1             3L
#define PINMUX_PA25D_SERCOM5_PAD1  ((PIN_PA25D_SERCOM5_PAD1 << 16) | MUX_PA25D_SERCOM5_PAD1)
#define PORT_PA25D_SERCOM5_PAD1    (1ul << 25)
#define PIN_PB03D_SERCOM5_PAD1            35L  /**< \brief SERCOM5 signal: PAD1 on PB03 mux D */
#define MUX_PB03D_SERCOM5_PAD1             3L
#define PINMUX_PB03D_SERCOM5_PAD1  ((PIN_PB03D_SERCOM5_PAD1 << 16) | MUX_PB03D_SERCOM5_PAD1)
#define PORT_PB03D_SERCOM5_PAD1    (1ul <<  3)
#define PIN_PB21D_SERCOM5_PAD1            53L  /**< \brief SERCOM5 signal: PAD1 on PB21 mux D */
#define MUX_PB21D_SERCOM5_PAD1             3L
#define PINMUX_PB21D_SERCOM5_PAD1  ((PIN_PB21D_SERCOM5_PAD1 << 16) | MUX_PB21D_SERCOM5_PAD1)
#define PORT_PB21D_SERCOM5_PAD1    (1ul << 21)
#define PIN_PB17C_SERCOM5_PAD1            49L  /**< \brief SERCOM5 signal: PAD1 on PB17 mux C */
